In [11]:
import psycopg2
import os
from dotenv import load_dotenv
import numpy as np
import pandas as pd

In [12]:
# Загрузить переменные окружения

load_dotenv()

# Получить переменную окружения
db_name = os.getenv("DB_NAME")
db_user = os.getenv("DB_USER")
db_password = os.getenv("DB_PASSWORD")
db_host = os.getenv("DB_HOST")
db_port = os.getenv("DB_PORT")

In [13]:
connection = psycopg2.connect(
    database=db_name, user=db_user, password=db_password, host=db_host, port=db_port
)
cursor = connection.cursor()

In [14]:
df = pd.read_sql('''
SELECT * FROM post;
''',connection)
df

/tmp/ipykernel_53737/996451875.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

        id                                               text       topic
0        1  Sort people key. Professor laugh worry artist....         leg
1        2  Class game stay do machine institution.\nWhile...     officer
2        3  Alone choose program increase world society.\n...        foot
3        4  Yeah price health trade could strong. Clearly ...        work
4        5  Why world late. Stay ball eight nice beyond no...  generation
...    ...                                                ...         ...
1039  1040  View serve all glass job fill shake. Field ran...        main
1040  1041  Hand would outside kitchen. That radio record ...  Republican
1041  1042  Week accept a so exist figure decision. Ago fi...       owner
1042  1043  Figure church war fear national. Account aroun...       occur
1043  1044  House here although involve. Money seven plan ...        bill

[1044 rows x 3 columns]

In [15]:
t = df['topic'].values
l = ""
for i in t:
    if len(i)>len(l):
        l = i
print(len(t),l)

1044 administration

In [16]:
df = pd.read_sql('''SELECT * FROM "user" AS u
                    WHERE u.age > 30 AND u.os = 'iOS';
                 ''',connection)
print(df['id'].values[0], df['city'].values[0])

1 South Jeffreymouth

/tmp/ipykernel_53737/1600272196.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT * FROM "user" AS u

In [17]:
df = pd.read_sql('''
SELECT * FROM "user" as u
WHERE u.exp_group <> 3 AND u.exp_group <> 0 AND u.city = 'South Ashley' AND COUNTRY !='Russia';
''',
connection)
df

/tmp/ipykernel_53737/103286596.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

,id,gender,age,country,city,exp_group,os,source
0,4,Female,51,Singapore,South Ashley,1,Windows,lozano-anderson.com
1,910,Male,39,Cayman Islands,South Ashley,2,Android,shaw.info

In [18]:
df = pd.read_sql('''
SELECT age, country FROM "user" as u
WHERE country = 'Japan';
''',
connection)
np.around(df['age'].mean(),2)

/tmp/ipykernel_53737/3885211706.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

np.float64(42.33)

In [19]:
df = pd.read_sql('''
SELECT exp_group, os, COUNT(*), MIN(age), MAX(age) FROM "user" 
GROUP BY exp_group, os
ORDER BY "user".exp_group;
                 
''',connection)
df = df.to_csv('./csv_group_by_1.csv',sep=',', header=['exp_group','os','total_users','min_age','max_age'])
pd.read_csv('./csv_group_by_1.csv')

/tmp/ipykernel_53737/3088059918.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

    Unnamed: 0  exp_group       os  total_users  min_age  max_age
0            0          0  Android          100       19       60
1            1          0      iOS           84       18       60
2            2          0  Windows           87       18       60
3            3          1      iOS           93       18       60
4            4          1  Windows           99       18       58
5            5          1  Android           86       18       60
6            6          2  Android          102       18       60
7            7          2  Windows           78       18       60
8            8          2      iOS           92       18       60
9            9          3      iOS           95       18       60
10          10          3  Windows           90       18       60
11          11          3  Android           94       18       60

In [20]:
df = pd.read_sql('''
SELECT topic, MAX(LENGTH(text)) FROM post
GROUP BY topic
''',connection)
df

/tmp/ipykernel_53737/2001499091.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

         topic  max
0    establish  188
1       assume  168
2         page  195
3        major  196
4       entire  172
..         ...  ...
638       poor  173
639    concern  185
640    between  198
641        hot  170
642        see  127

[643 rows x 2 columns]

In [21]:
df = pd.read_sql('''SELECT country, COUNT(*) as c FROM "user" AS u
                    GROUP BY country 
                    HAVING COUNT(*) > 3 
''',connection)
df

/tmp/ipykernel_53737/3538815549.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT country, COUNT(*) as c FROM "user" AS u

                  country  c
0              Bangladesh  6
1       Brunei Darussalam  4
2                   Korea  4
3              Luxembourg  7
4    Syrian Arab Republic  4
..                    ... ..
151             Greenland  5
152                Jersey  7
153             Gibraltar  4
154               Andorra  7
155               Somalia  5

[156 rows x 2 columns]

In [22]:
df = pd.read_sql('''SELECT country, exp_group, COUNT(id)
FROM "user"
GROUP BY country, exp_group;
''',connection)
df

/tmp/ipykernel_53737/1330726539.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT country, exp_group, COUNT(id)

                      country  exp_group  count
0                     Austria          1      2
1                       Chile          0      2
2                     Bolivia          3      2
3                    Suriname          2      3
4    Central African Republic          3      2
..                        ...        ...    ...
646                 Indonesia          3      1
647                 Guatemala          2      1
648                  Tanzania          0      1
649                     India          0      1
650                Mozambique          1      1

[651 rows x 3 columns]

In [23]:
df = pd.read_sql('''
SELECT * FROM "user" 
WHERE city = 'Davisberg'
''', connection)
df

/tmp/ipykernel_53737/1605592633.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

,id,gender,age,country,city,exp_group,os,source
0,8,Female,41,Uganda,Davisberg,1,Windows,rodriguez-campos.org
1,571,Female,27,Andorra,Davisberg,2,iOS,vargas.com

In [24]:
df = pd.read_sql('''SELECT topic, COUNT(*) FROM post
                    GROUP BY topic
                    ORDER BY COUNT(*) DESC
                    LIMIT 3;  
                ''',connection)
df

/tmp/ipykernel_53737/2080583341.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT topic, COUNT(*) FROM post

     topic  count
0    piece      7
1  several      6
2  concern      6

In [25]:
df = pd.read_sql('''SELECT id,age, exp_group,COUNT(*)  FROM "user"
                    where country = 'Poland'
                    GROUP BY id,age, exp_group
                    ORDER BY age DESC, exp_group ASC
                ''',connection)
df['id'][2]

/tmp/ipykernel_53737/158732818.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT id,age, exp_group,COUNT(*)  FROM "user"

np.int64(362)

In [26]:
df = pd.read_sql('''
SELECT u.id , f.user_id, p.id, f.post_id , f.time , u.os, u.age FROM "user" u 
JOIN feed_action f ON u.id = f.user_id
JOIN post p on p.id = f.user_id
ORDER BY f.time
''',connection)
df

/tmp/ipykernel_53737/3882976520.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

       id  user_id  id  post_id                       time       os  age
0      47       47  47      675 2024-01-01 01:11:23.062825  Windows   53
1      23       23  23      935 2024-01-01 01:25:10.481004  Windows   22
2       4        4   4       47 2024-01-01 01:25:34.678305  Windows   51
3      23       23  23      945 2024-01-01 02:08:29.393934  Windows   22
4       8        8   8       45 2024-01-01 02:34:56.177620  Windows   41
...    ..      ...  ..      ...                        ...      ...  ...
13333  82       82  82      733 2024-10-25 10:42:08.039558  Android   27
13334  22       22  22      676 2024-10-25 10:45:23.053800  Windows   34
13335   9        9   9      846 2024-10-25 10:49:05.618497      iOS   45
13336  54       54  54      776 2024-10-25 12:56:19.915915  Windows   29
13337  13       13  13      847 2024-10-25 13:57:23.689104  Windows   41

[13338 rows x 7 columns]

In [27]:
df = pd.read_sql('''
SELECT f.post_id, COUNT(f.action), MAX(f.time) AS c FROM post p
JOIN feed_action f on p.id = f.post_id
GROUP BY f.post_id
ORDER BY c DESC;
''',connection)
df

/tmp/ipykernel_53737/2543332372.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

     post_id  count                          c
0        847     23 2024-10-25 13:57:23.689104
1        776     19 2024-10-25 12:56:19.915915
2        846     28 2024-10-25 10:49:05.618497
3        676     30 2024-10-25 10:45:23.053800
4        733     29 2024-10-25 10:42:08.039558
..       ...    ...                        ...
539      738     15 2024-08-27 17:17:54.689981
540      982     18 2024-08-27 13:23:46.962901
541      796     17 2024-08-21 16:58:42.438941
542      570     21 2024-08-16 20:42:38.834421
543      696     16 2024-08-16 00:41:52.548866

[544 rows x 3 columns]